RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_lpadc.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef FSL_LPADC_H_
#define FSL_LPADC_H_

#include "fsl_common.h"

/*!
 * @addtogroup lpadc
 * @{
 */

/*! @file */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*! @{ */
/*! @brief LPADC driver version 2.9.3. */
#define FSL_LPADC_DRIVER_VERSION (MAKE_VERSION(2, 9, 3))
/*! @} */

/*! @name Configuration */

/*!
 * @brief Max loops to wait for LPADC conversion complete
 *
 * When doing calibration, driver will wait for the completion of conversion.
 * This parameter defines how many loops to check completion before return timeout.
 * If defined as 0, driver will wait forever until completion.
 */
#ifndef LPADC_CONVERSION_COMPLETE_TIMEOUT
    #ifdef CONFIG_LPADC_CONVERSION_COMPLETE_TIMEOUT
        #define LPADC_CONVERSION_COMPLETE_TIMEOUT CONFIG_LPADC_CONVERSION_COMPLETE_TIMEOUT
    #else
        #define LPADC_CONVERSION_COMPLETE_TIMEOUT 0U
    #endif
#endif

/*!
 * @brief Max loops to wait for LPADC calibration ready
 *
 * Before doing calibration, driver will wait for the calibration ready.
 * This parameter defines how many loops to check the calibration ready.
 * If defined as 0, driver will wait forever until ready.
 */
#ifndef LPADC_CALIBRATION_READY_TIMEOUT
#ifdef CONFIG_LPADC_CALIBRATION_READY_TIMEOUT
    #define LPADC_CALIBRATION_READY_TIMEOUT CONFIG_LPADC_CALIBRATION_READY_TIMEOUT
#else
    #define LPADC_CALIBRATION_READY_TIMEOUT 0U
#endif
#endif

/*!
 * @brief Max loops to wait for LPADC gain calibration GAIN_CAL ready
 *
 * Before doing calibration, driver will wait for the gain calibration GAIN_CAL ready.
 * This parameter defines how many loops to check the gain calibration GAIN_CAL ready.
 * If defined as 0, driver will wait forever until ready.
 */
#ifndef LPADC_GAIN_CAL_READY_TIMEOUT
#ifdef CONFIG_LPADC_GAIN_CAL_READY_TIMEOUT
    #define LPADC_GAIN_CAL_READY_TIMEOUT CONFIG_LPADC_GAIN_CAL_READY_TIMEOUT
#else
    #define LPADC_GAIN_CAL_READY_TIMEOUT 0U
#endif
#endif

#if (defined(FSL_FEATURE_LPADC_OFSTRIM_COUNT) && (FSL_FEATURE_LPADC_OFSTRIM_COUNT == 1))
#define ADC_OFSTRIM_OFSTRIM_MAX  (ADC_OFSTRIM_OFSTRIM_MASK >> ADC_OFSTRIM_OFSTRIM_SHIFT)
#define ADC_OFSTRIM_OFSTRIM_SIGN ((ADC_OFSTRIM_OFSTRIM_MAX + 1U) >> 1U)

#elif (defined(FSL_FEATURE_LPADC_OFSTRIM_COUNT) && (FSL_FEATURE_LPADC_OFSTRIM_COUNT == 2))
#define ADC_OFSTRIM_OFSTRIM_A_MAX  (ADC_OFSTRIM_OFSTRIM_A_MASK >> ADC_OFSTRIM_OFSTRIM_A_SHIFT)
#define ADC_OFSTRIM_OFSTRIM_B_MAX  (ADC_OFSTRIM_OFSTRIM_B_MASK >> ADC_OFSTRIM_OFSTRIM_B_SHIFT)
#define ADC_OFSTRIM_OFSTRIM_A_SIGN ((ADC_OFSTRIM_OFSTRIM_A_MAX + 1U) >> 1U)
#define ADC_OFSTRIM_OFSTRIM_B_SIGN ((ADC_OFSTRIM_OFSTRIM_B_MAX + 1U) >> 1U)
#endif /* defined(FSL_FEATURE_LPADC_OFSTRIM_COUNT) */

/*!
 * @brief Define the MACRO function to get command status from status value.
 *
 * The statusVal is the return value from LPADC_GetStatusFlags().
 */
#define LPADC_GET_ACTIVE_COMMAND_STATUS(statusVal) ((statusVal & ADC_STAT_CMDACT_MASK) >> ADC_STAT_CMDACT_SHIFT)

/*!
 * @brief Define the MACRO function to get trigger status from status value.
 *
 * The statusVal is the return value from LPADC_GetStatusFlags().
 */
#define LPADC_GET_ACTIVE_TRIGGER_STATUE(statusVal) ((statusVal & ADC_STAT_TRGACT_MASK) >> ADC_STAT_TRGACT_SHIFT)

/* Map macros to the unified name. */
#if !defined(ADC_STAT_FOF0_MASK)
#ifdef ADC_STAT_FOF_MASK
#define ADC_STAT_FOF0_MASK ADC_STAT_FOF_MASK
#else
#error "ADC_STAT_FOF0_MASK not defined"
#endif /* ifdef(ADC_STAT_FOF_MASK) */
#endif /* !defined(ADC_STAT_FOF0_MASK) */

#if !defined(ADC_STAT_RDY0_MASK)
#ifdef ADC_STAT_RDY_MASK
#define ADC_STAT_RDY0_MASK ADC_STAT_RDY_MASK
#else
#error "ADC_STAT_RDY0_MASK not defined"
#endif /* ifdef ADC_STAT_RDY_MASK */
#endif /* !defined(ADC_STAT_RDY0_MASK) */

#if !defined(ADC_IE_FOFIE0_MASK)
#ifdef ADC_IE_FOFIE_MASK
#define ADC_IE_FOFIE0_MASK ADC_IE_FOFIE_MASK
#else
#error "ADC_IE_FOFIE0_MASK not defined"
#endif /* ifdef ADC_IE_FOFIE_MASK */
#endif /* !defined(ADC_IE_FOFIE0_MASK) */

#if !defined(ADC_IE_FWMIE0_MASK)
#ifdef ADC_IE_FWMIE_MASK
#define ADC_IE_FWMIE0_MASK ADC_IE_FWMIE_MASK
#else
#error "ADC_IE_FWMIE0_MASK not defined"
#endif /* ifdef ADC_IE_FWMIE_MASK */
#endif /* !defined(ADC_IE_FWMIE0_MASK) */

/*!
 * @brief Define hardware flags of the module.
 */
enum _lpadc_status_flags
{
    kLPADC_ResultFIFO0OverflowFlag = ADC_STAT_FOF0_MASK, /*!< Indicates that more data has been written to the Result
                                                               FIFO 0 than it can hold. */
    kLPADC_ResultFIFO0ReadyFlag = ADC_STAT_RDY0_MASK,    /*!< Indicates when the number of valid datawords in the result
                                                               FIFO 0 is greater than the setting watermark level. */

#if (defined(FSL_FEATURE_LPADC_FIFO_COUNT) && (FSL_FEATURE_LPADC_FIFO_COUNT == 2U))
    kLPADC_ResultFIFO1OverflowFlag = ADC_STAT_FOF1_MASK, /*!< Indicates that more data has been written to the Result
                                                              FIFO 1 than it can hold. */
    kLPADC_ResultFIFO1ReadyFlag = ADC_STAT_RDY1_MASK,    /*!< Indicates when the number of valid datawords in the result
                                                              FIFO 1 is greater than the setting watermark level. */
#endif /* (defined(FSL_FEATURE_LPADC_FIFO_COUNT) && (FSL_FEATURE_LPADC_FIFO_COUNT == 2U)) */

#if (defined(FSL_FEATURE_LPADC_HAS_STAT_TEXC_INT) && (FSL_FEATURE_LPADC_HAS_STAT_TEXC_INT == 1U))
    kLPADC_TriggerExceptionFlag = ADC_STAT_TEXC_INT_MASK, /*!< Indicates that a trigger exception event has occurred. */
#endif /* (defined(FSL_FEATURE_LPADC_HAS_STAT_TEXC_INT) && (FSL_FEATURE_LPADC_HAS_STAT_TEXC_INT == 1U)) */

#if (defined(FSL_FEATURE_LPADC_HAS_STAT_TCOMP_INT) && (FSL_FEATURE_LPADC_HAS_STAT_TCOMP_INT == 1U))
    kLPADC_TriggerCompletionFlag = ADC_STAT_TCOMP_INT_MASK, /*!< Indicates that a trigger completion event has occurred.
                                                             */
#endif /* (defined(FSL_FEATURE_LPADC_HAS_STAT_TCOMP_INT) && (FSL_FEATURE_LPADC_HAS_STAT_TCOMP_INT == 1U)) */

