RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_lpadc.h
#if defined(FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE) && FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE
/*!
 * @brief Set offset calibration mode.
 *
 * @param base LPADC peripheral base address.
 * @param mode set offset calibration mode.see to #lpadc_offset_calibration_mode_t .
 */
static inline void LPADC_SetOffsetCalibrationMode(ADC_Type *base, lpadc_offset_calibration_mode_t mode)
{
    base->CTRL = (base->CTRL & ~ADC_CTRL_CALOFSMODE_MASK) | ADC_CTRL_CALOFSMODE(mode);
}

#endif /* FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE */

/*!
 * @brief Do offset calibration.
 *
 * @param base LPADC peripheral base address.
 *
 * @retval kStatus_Success Successfully configured.
 * @retval kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t LPADC_DoOffsetCalibration(ADC_Type *base);

#if defined(FSL_FEATURE_LPADC_HAS_CTRL_CAL_REQ) && FSL_FEATURE_LPADC_HAS_CTRL_CAL_REQ
/*!
 * @brief Do auto calibration.
 *
 * @param base  LPADC peripheral base address.
 */
void LPADC_DoAutoCalibration(ADC_Type *base);

/*!
 * @brief Prepare auto calibration, LPADC_FinishAutoCalibration has to be called before using the LPADC.
 * LPADC_DoAutoCalibration has been split in two API to avoid to be stuck too long in the function.
 *
 * @param base  LPADC peripheral base address.
 */
void LPADC_PrepareAutoCalibration(ADC_Type *base);

#if defined(FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE) && FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE
/*!
 * @brief Finish auto calibration start with LPADC_PrepareAutoCalibration.
 * @note This feature is used for LPADC with CTRL[CALOFSMODE].
 *
 * @param base  LPADC peripheral base address.
 *
 * @retval kStatus_Success Successfully configured.
 * @retval kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t LPADC_FinishAutoCalibration(ADC_Type *base);
#else
/*!
 * @brief Finish auto calibration start with LPADC_PrepareAutoCalibration.
 * @note This feature is used for LPADC without CTRL[CALOFSMODE].
 *
 * @param base  LPADC peripheral base address.
 *
 * @retval kStatus_Success Successfully configured.
 * @retval kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t LPADC_FinishAutoCalibration(ADC_Type *base);
#endif /* FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE */
#endif /* FSL_FEATURE_LPADC_HAS_CTRL_CAL_REQ */

/*!
 * @brief Get calibration value into the memory which is defined by invoker.
 *
 * @note Please note the ADC will be disabled temporary.
 * @note This function should be used after finish calibration.
 *
 * @param base LPADC peripheral base address.
 * @param ptrCalibrationValue Pointer to @ref lpadc_calibration_value_t structure, this memory block should be always
 * powered on even in low power modes.
 */
void LPADC_GetCalibrationValue(ADC_Type *base, lpadc_calibration_value_t *ptrCalibrationValue);

/*!
 * @brief Set calibration value into ADC calibration registers.
 *
 * @note Please note the ADC will be disabled temporary.
 *
 * @param base LPADC peripheral base address.
 * @param ptrCalibrationValue Pointer to @ref lpadc_calibration_value_t structure which contains ADC's calibration
 * value.
 *
 * @retval kStatus_Success Successfully configured.
 * @retval kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t LPADC_SetCalibrationValue(ADC_Type *base, const lpadc_calibration_value_t *ptrCalibrationValue);

#endif /* FSL_FEATURE_LPADC_HAS_CTRL_CALOFS */

#if ((defined(FSL_FEATURE_LPADC_HAS_CTRL_CALHS)) && FSL_FEATURE_LPADC_HAS_CTRL_CALHS)
/*!
 * @brief Request high speed mode trim calculation.
 *
 * @param base LPADC peripheral base address.
 */
static inline void LPADC_RequestHighSpeedModeTrim(ADC_Type *base)
{
    base->CTRL |= ADC_CTRL_CALHS_MASK;
}

/*!
 * @brief Get high speed mode trim value, the result is a 5-bit signed value between -16 and 15.
 *
 * @note The high speed mode trim value is used to minimize offset for high speed conversion.
 *
 * @param base LPADC peripheral base address.
 * @return The calculated high speed mode trim value.
 */
static inline int8_t LPADC_GetHighSpeedTrimValue(ADC_Type *base)
{
    return (int8_t)(base->HSTRIM);
}

/*!
 * @brief Set high speed mode trim value.
 *
 * @note If is possible to set the trim value manually, but it is recommended to use the LPADC_RequestHighSpeedModeTrim.
 *
 * @param base LPADC peripheral base address.
 * @param trimValue The trim value to be set.
 */
static inline void LPADC_SetHighSpeedTrimValue(ADC_Type *base, int8_t trimValue)
{
    base->HSTRIM = ADC_HSTRIM_HSTRIM(trimValue);
}

/*!
 * @brief Enable/disable high speed conversion mode, if enabled conversions complete 2 or 3 ADCK cycles sooner compared
 * to conversion cycle counts when high speed mode is disabled.
 *
 * @param base LPADC peripheral base address.
 * @param enable Used to enable/disable high speed conversion mode:
 *     - \b true Enable high speed conversion mode;
 *     - \b false Disable high speed conversion mode.
 */
static inline void LPADC_EnableHighSpeedConversionMode(ADC_Type *base, bool enable)
{
    if (enable)
    {
        base->CFG2 |= ADC_CFG2_HS_MASK;
    }
    else
    {
        base->CFG2 &= ~ADC_CFG2_HS_MASK;
    }
}

/*!
 * @brief Enable/disable an additional ADCK cycle to conversion.
 *
 * @param base LPADC peripheral base address.
 * @param enable Used to enable/disable an additional ADCK cycle to conversion:
 *          - \b true Enable an additional ADCK cycle to conversion;
 *          - \b false Disable an additional ADCK cycle to conversion.
 */
static inline void LPADC_EnableExtraCycle(ADC_Type *base, bool enable)
{
    if (enable)
    {
        base->CFG2 |= ADC_CFG2_HSEXTRA_MASK;
    }
    else
    {
        base->CFG2 &= ~ADC_CFG2_HSEXTRA_MASK;
    }
}

/*!
 * @brief Set tune value which provides some variability in how many cycles are needed to complete a conversion.
 *
 * @param base LPADC peripheral base address.
 * @param tuneValue The tune value to be set, please refer to @ref lpadc_tune_value_t.
 */
static inline void LPADC_SetTuneValue(ADC_Type *base, lpadc_tune_value_t tuneValue)
{
    base->CFG2 = (base->CFG2 & ~ADC_CFG2_TUNE_MASK) | ADC_CFG2_TUNE(tuneValue);
}

/*!
 * @brief Get tune value which provides some variability in how many cycles are needed to complete a conversion.
 *
 * @param base LPADC peripheral base address.
 * @return The tune value, please refer to @ref lpadc_tune_value_t.
 */
static inline lpadc_tune_value_t LPADC_GetTuneValue(ADC_Type *base)
{
    return (lpadc_tune_value_t)(uint32_t)((base->CFG2 & ADC_CFG2_TUNE_MASK) >> ADC_CFG2_TUNE_SHIFT);
}
#endif /* ((defined(FSL_FEATURE_LPADC_HAS_CTRL_CALHS)) && FSL_FEATURE_LPADC_HAS_CTRL_CALHS) */

#if (defined(FSL_FEATURE_LPADC_HAS_CFG2_JLEFT) && FSL_FEATURE_LPADC_HAS_CFG2_JLEFT)
/*!
 * @brief Enable/disable left-justify format in 12-bit single-end mode.
 *
 * @param base LPADC peripheral base address.
 * @param enable Used to enable/disable left-justify format in 12-bit single-end mode:
 *          - \b true Enable left-justify format in 12-bit single-end mode;
 *          - \b false Disable left-justify format in 12-bit single-end mode.
 */
static inline void LPADC_EnableJustifiedLeft(ADC_Type *base, bool enable)
{
    if (enable)
    {
        base->CFG2 |= ADC_CFG2_JLEFT_MASK;
    }
    else
    {
        base->CFG2 &= ~ADC_CFG2_JLEFT_MASK;
    }
}
#endif /* (defined(FSL_FEATURE_LPADC_HAS_CFG2_JLEFT) && FSL_FEATURE_LPADC_HAS_CFG2_JLEFT) */

/*! @} */

#if defined(__cplusplus)
}
#endif
/*!
 * @}
 */
#endif /* FSL_LPADC_H_ */
